Repository: alexander-azizi-martin/uo.zone
Catalog: frontend/src/locales/*.po
Languages: fr

source: {0, select, en {English Equivalent} fr {French Equivalent} other {}}
fr: {0, select, en {Équivalent Anglais} fr {Équivalent Français} other {}}

source: {0} {1, plural, one {student} other {students}}
fr: {0} {1, plural, one {étudiant} other {étudiants}}

source: {0} {1, plural, one {student} other {students}} got {2, select, A {an} other {a}} {selectedGrade} ({3}%)
fr: {0} {1, plural, one {étudiant a} other {étudiants ont}} reçu un {selectedGrade} ({3}%)

source: {0} {1, plural, one {unit} other {units}}
fr: {0} {1, plural, one {crédit} other {crédits}}

source: {0} Average ({1})
fr: Moyenne {0} ({1})

source: {0} sections during {oldestTerm}
fr: {0} section pendant l''{oldestTerm}

source: {0} sections from {oldestTerm} to {newestTerm}
fr: {0} section de l''{oldestTerm} au l''{newestTerm}

source: 1st Year
fr: 1ère Année

source: 2nd Year
fr: 2ème Année

source: 3rd Year
fr: 3ème Année

source: 4th Year
fr: 4ème Année

source: All Courses
fr: Tous Les Cours

source: All Courses For {0}
fr: Tous Les Cours Pour {0}

source: All Professors
fr: Tous Les Professeurs

source: Available
fr: Disponible

source: Average
fr: Moyenne

source: Check out <0>uEnroll</0> to create your course schedules!
fr: Rendez-vous sur <0>uEnroll</0> pour créer vos horaires de cours!

source: Clear Communication
fr: Communication Claire

source: Clear Expectations
fr: Attentes claires

source: Components
fr: Volet

source: Courses
fr: Cours

source: Data from Fall 2017 to Summer 2024 provided by <0>The Access to Information and Privacy Office</0> and <1>uoZone</1>
fr: L'information de l'Automne 2017 au l'Hiver 2025 ont été fournies par <0>Le Bureau de l'accès à l'information et de la protection de la vie privée</0> and <1>uoZone</1>

source: English
fr: Anglais

source: Evaluations
fr: Évaluations

source: Fair Assessments
fr: Évaluations Équitables

source: Fall
fr: Automne

source: Filter
fr: Filtre

source: Filter Language
fr: Langue du Filtre

source: Filter Term
fr: Terme de filtre

source: Filter Year
fr: Année de Filtrage

source: French
fr: Français

source: Good Feedback
fr: Bons Retours

source: Good Instructions
fr: Bonnes Instructions

source: Grades
fr: Notes

source: Graduate
fr: Supérieures

source: https://uozone2.uottawa.ca/en/apps/s-reports
fr: https://uozone2.uottawa.ca/fr/apps/s-reports?language=fr

source: https://www.uottawa.ca/about-us/aipo
fr: https://www.uottawa.ca/notre-universite/baipvp

source: Learned a Lot
fr: Beaucoup Appris

source: Loading...
fr: Chargement...

source: maintained by
fr: maintenu par

source: Most Common: {0} ({1}%)
fr: Le plus fréquent: {0} ({1}%)

source: No course matches the filters.
fr: Aucun cours ne correspond aux filtres.

source: No grade data available for this course.
fr: Aucune donnée sur les notes n'est disponible pour ce cours.

source: No grade data.
fr: Pas de données sur les notes.

source: No results found.
fr: Aucun résultat n'a été trouvé.

source: No survey data.
fr: Pas de données d'enquête.

source: Number of RateMyProfessor reviews
fr: Nombre d’avis RateMyProfessor

source: Organized
fr: Organisé

source: Prepared
fr: Préparé

source: Previously Offered Terms
fr: Terme proposées précédemment

source: Professors
fr: Professeurs

source: RateMyProfessor difficulty
fr: Difficulté RateMyProfessor

source: RateMyProfessor rating
fr: Note RateMyProfessor

source: Recommend
fr: Recommander

source: Requirements
fr: Exigences

source: Reset Filters
fr: Réinitialiser les filtres

source: Respectful
fr: Respectueux

source: responses
fr: réponses

source: RMP Difficulty
fr: Difficulté RMP

source: RMP Rating
fr: Notation RMP

source: RMP ratings
fr: Notations RMP

source: Search by Course, Professor, or Subject
fr: Recherche par Cour, Professeur ou Sujet

source: Search Results for “{query}”
fr: Résultats pour “{query}”

source: Something went wrong during your request.
fr: Une erreur s'est produite lors de votre demande.

source: Sort By
fr: Trier par

source: Subjects
fr: Sujets

source: Summer
fr: Été

source: The {0, plural, one {professor for this course section is} other {professors for these course sections are}} not known.
fr: {0, plural, one {Le professeur de cette section} other {Les professeurs de ces sections}} de cours n'est pas connu.

source: The website is currently under maintenance.
fr: Le site web est actuellement en maintenance.

source: This page does not exist.
fr: Cette page n'existe pas.

source: This total also includes classes that they may not teach anymore.
fr: Ce total comprend également les classes qu'ils n'enseignent peut-être plus.

source: Unknown {0, plural, one {Professor} other {Professors}}
fr: {0, plural, one {Professeur} other {Professeurs}} Inconnus

source: View all the past grades for courses taken at the University of Ottawa.
fr: Voir toutes les notes antérieures des cours suivis à l'Université d'Ottawa.

source: View on RateMyProfessor
fr: Vue sur RateMyProfessor

source: Winter
fr: Hiver

source: Workload
fr: Charge de Travail
